{"en":[["heading","Privacy Policy"],["paragraph","Our application only collects the data necessarily needed to make our app function. The Wizzl team has the right to modify the terms defined in the Privacy Policy without notifying the users in any way."],["secondary_heading","Data collection"],["list",["During registration, the username, password, and email defined by the user will be saved.","Passwords will be saved to our database using multiple encryption.","Neither external nor internal persons have access to our database directly.","When viewing, all browsers acquire a unique temporary identifier needed to follow the activation process."]],["secondary_heading","Maintaining security"],["list",["In order to maintain the safety of your account, be sure to only log in to your account on the wizzl.co site, and not on another fake website. ","In case the possibility occurs that someone has gained unauthorized access to your profile, it is strongly advised to change your password, and contact us via this email: hi@wizzl.co.","Only click on the \"stay signed in\" option on a trusted device when logging in. "]],["secondary_heading","IP addresses"],["list",["Your IP address will be temporarily saved during registration, and when you log in.","These addresses are saved for security reasons.","If \"stay logged in\" is not switched on when logging in, you will only be able to gain access to your profile on the IP address you used to log in."]],["secondary_heading","Use of collected data"],["list",["We will not share any of the collected data with a third party.","We strictly only use the collected data for security optimization, and for filtering content.","You can delete your personal data in settings. (Your user profile will be saved for 15 days, after the deletion occurs. In case you'd like to cancel the deletion of your account within this time-span, you can contact us on this email: hi@wizzl.co.) (We won't be able to restore your activity, or the rest of your personal data.)"]],["secondary_heading","Browser tracking"],["list",["We store a unique identifier in each browser to track your activity for content filtering data.","We use this to keep track of how many accounts you sign into, and what operating system you are using. We need this in order to provide the best possible user experience.","This data is stored temporarily, and will automatically face deletion within a couple of days.","This data won't be shared with any third parties either."]]]}